OpenFoam/validation1rod/CHT/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.7;

boundaryField
{
    Inlet       { type fixedValue; value uniform 293.7; }
    
    fluid_to_solid     
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappa           fluidThermo;
        QrNbr           none;
        Qr              Qr;
        kappaName       none;
        value           uniform 293.7;
    }
   
    Outlet      { type zeroGradient; }
    Outterwall  { type zeroGradient; }
    LeftWedge   { type wedge; }
    RightWedge  { type wedge; }
}


// ************************************************************************* //
