OpenFoam/validation1rod/CHT/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.7;

boundaryField
{
    CHTInlet       { type zeroGradient; }
    CHTOutlet      { type zeroGradient; }

    solid_to_fluid                  
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappa           solidThermo;
        QrNbr           Qr;
        Qr              none;
        kappaName       none;
        value           uniform 293.7;
    }

    axis           { type empty; }
    CHTLeftWedge   { type wedge; }
    CHTRightWedge  { type wedge; }
}


// ************************************************************************* //
