OpenFoam/validation1rod/CHT/0/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    CHTInlet           { type fixedValue; value uniform 101325;}
    CHTOutlet          { type fixedValue; value uniform 101325;}
    CHTLeftWedge       { type wedge; }
    CHTRightWedge      { type wedge; }
    solid_to_fluid     { type fixedValue; value uniform 101325;}
}


// ************************************************************************* //
