OpenFoam/validation1rod/CHT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    CHTLeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          400;
        startFace       8656;
    }
    CHTRightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          400;
        startFace       9056;
    }
    LeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       9456;
    }
    RightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4000;
        startFace       13456;
    }
    Inlet
    {
        type            patch;
        nFaces          40;
        startFace       17456;
    }
    Outlet
    {
        type            patch;
        nFaces          40;
        startFace       17496;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       17536;
    }
    Outterwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       17536;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       17636;
    }
)

// ************************************************************************* //
