OpenFoam/validation1rod/CHT/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    CHTLeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          400;
        startFace       696;
    }
    CHTRightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          400;
        startFace       1096;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8;
        startFace       1496;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1504;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
